package com.skyshield.game.gui.dialog;

import com.badlogic.gdx.Gdx;
import com.badlogic.gdx.graphics.g2d.BitmapFont;
import com.badlogic.gdx.graphics.g2d.freetype.FreeTypeFontGenerator;
import com.badlogic.gdx.scenes.scene2d.ui.Table;
import com.skyshield.game.screens.GameScreen;
import com.skyshield.game.sound.GameDialog;

public class DialogText extends Table {

    public static int textCounter = 1;
    final float letterSpawnTime = .077f;
    float timer = 0;

    String drawText;
    int stringIndex = 0;

    public static BitmapFont font;
    private String text;
    private boolean written;
    public DialogText(String text) {
        this.text = text;
        this.drawText = "";
        setFont();
        this.written = false;
    }

    public boolean isWritten() {
        return this.written;
    }

    public void update(float delta) {
        timer += delta;
        if (timer >= letterSpawnTime) {
            if(stringIndex > 196 && stringIndex<text.length()) {
                if(text.charAt(stringIndex) == '\n') drawText = drawText.substring(drawText.split("\\n")[0].length()+1) + text.charAt(stringIndex);
                else drawText = drawText + text.charAt(stringIndex);
                stringIndex++;
            }
            else if(stringIndex<text.length()) {
                drawText = drawText + text.charAt(stringIndex);
                stringIndex++;
            }else written = true;
            timer -= letterSpawnTime;
        }
        GameScreen.stage.getBatch().begin();
        font.draw(GameScreen.stage.getBatch(), drawText, 185, 630);
        GameScreen.stage.getBatch().end();
    }


    public void setFont() {
        FreeTypeFontGenerator fontGenerator = new FreeTypeFontGenerator(Gdx.files.internal("a_OldTyper.ttf"));
        FreeTypeFontGenerator.FreeTypeFontParameter fontParameter = new FreeTypeFontGenerator.FreeTypeFontParameter();
        fontParameter.characters = "абвгґдеєжзиійїклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЙЇКЛМНОПРСТУФХЦЧШЩЬЮЯ,,.?«»\"’–-:;!…1234567890ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz!@#$%^&*()_+=-`~|/<>";
        fontParameter.size = 15;
        font = fontGenerator.generateFont(fontParameter);
        GameScreen.disposableFonts.add(font);
        fontGenerator.dispose();
    }

    public void skip() {
        text = (text.length() < 196) ? text : text.substring(text.length()-196);
//        if(text.charAt(0)!='\n') text = text.substring(text.split("\\n")[0].length()+1);
        drawText = text;
        stringIndex = drawText.length();
        GameDialog.removeSound();
    };

    public static String getFormattedText() {
        StringBuilder sb = new StringBuilder();
        String[] text = getText().split("\\n");

        for (String string : text) {
            while (string.length() > 28) {

                sb.append(string, 0, 28);
                string = string.substring(28);

                if (string.charAt(0) != ' ' && string.length() != 1) sb.append("-");

                sb.append("\n");
            }
            sb.append(string).append("\n");
        }
        return sb.substring(0, sb.length()-2);
    }
    public static String getText() {
        switch (textCounter) {
            case 1 -> {
                return "Алло, алло, прийом. Фух, нарешті вийшло зв’язатися з тобою, салаго. На рації генерал Аскель, головнокомандувач військових сил Етерії. Хоча, навіщо я це кажу, ти ж і так знаєш, як звуть начальство? Проїхали. В буремні часи живемо, салаго… Одначе, місія тобі довірена справді надважлива. Ти навіть не уявляєш яка важлива.\n" +
                        "Ми довго готувалися до цієї війни, проте нам і в голову не приходило, що тупоголові ординці навчаться використовувати провідну повітряну зброю. Інформація про те, що ворог має на озброєнні залізних птахів, по простому ракети, надійшла від нашої розвідки лише тиждень тому. Ми і самі не можемо в це повірити. Ми вважали, що крізь нашу розвідку і муха на пролетить, але ці покидьки примудрилися домовитися з цивілізаціями сходу про поставки і тримали їх у великій таємниці. Акзилія погодилася надати нам певні елементи своєї системи «Небесний щит». Оскільки часу до вторгнення залишалося обмаль, ми тільки-но імпортували перші установки. Поки що в нашому розпорядженні тільки найпростіша зброя: «Крони» першого, другого та третього поколінь. Різняться базовими характеристиками та і тільки. Їх головнокомандувач надав певні інструкції з використання, передаю їх тобі:\n" +
                        "Там нічого складного насправді. Оптимальна швидкість – це показник, який вказує максимальну швидкість повітряного об’єкта, на якій установка здатна збивати його з максимальною ефективністю. Якщо об’єкт летить швидше, ефективність падатиме.\n" +
                        "Оптимальний розмір – схожа механіка. Хіба що динаміка протилежна – менші об’єкти збивати тяжче.\n" +
                        "Перезарядка – час, необхідний на те, щоб установка знову увійшла в стрій після спроби збиття.\n" +
                        "Радіус вказує на те, яку площу покриває установка.\n" +
                        "Рівномірність – здатність зберігати центрову ефективність на краях діапазону дії.\n" +
                        "По суті ці п’ять характеристик визначають ефективність установки. Думаю, що ти розберешся з цими справами. Тобі доручено керувати системою, а отже розставити всі елементи у стратегічній відповідності, захистивши ключові об’єкти.\n" +
                        "Наразі наша розвідка доповідає, що наступні удари можуть прийтися по Сільвестрісу та Інтерфлюмінусу із району ворожого міста Зулим-Кала. Поки що на балансі не так багато валюти, тож встанови по установці першого рівня поблизу цих міст. Удачі.\n";
            }
            case 2 -> {
                return "ЮХУ! Обидві повітряні цілі збито. Молодець, салаго. Щоправда, ми маємо невелику проблемку – повідомляють про пуск ще однієї пташки в район гір, вірогідно, у місто Монфіор. Моє рідне, до речі. Хай вони тільки спробують.";
            }
            case 3 -> {
                return "ЧОРТ! Ціль досягла міста! О рідний мій Монфіор! Вони заплатять за це, чуєш! Будь проклятий Карам-Гулук!\n" +
                        "Салаго… Тобі доведеться трохи приглянути за містом. Обери його на екрані та віддай наказ ремонтувати.\n";
            }
            case 4 -> {
                return "Молодець. Моє місто житиме. Продовжуй в тому ж дусі, друже.";
            }
            case 5 -> {
                return "Друже… Маю погані новини. Схоже, що ці мерзоти зрозуміли, що ми пристосувалися до їх атак, тому вирішили піднакопичити пташок для серйозного обстрілу. Поки що я не знаю, як наші системи впораються з таким навантаженням, проте я вибив із уряду додаткові 20000 монет. Цього тобі вистачить аж на 40 перших «Крон». Ну або на 4 треті. Розпоряжайся вже, як знаєш. Ти тут оператор Удачі, салаго.";
            }
            case 6 -> {
                return "Мені зозуля на хвості принесла, що ти відбив атаку? Не сумнівався в тобі, бійцю. Так ти скоро і на підвищення підеш. Проте не розслабляйся, попереду ще довга війна. І вони ще застосують багато нового озброєння та багато нових тактик, повір.";
            }
            case 7 -> {
                return "Друже… Маю погані новини. Знову. Вони знову накопичили багато зброї. І, якщо мої джерела достовірні, вони готуються застосувати нову ракету. Кріпись. Від тебе багато залежить. Удачі, салаго.";
            }
            case 8 -> {
                return "Чудово. Ми пережили атаку. А зараз відбій.\n" +
                        "Хороші новини з фронту. Завдяки поставкам зброї. вдалося трохи відсунути натиск загарбників. Якщо все йтиме за планом, скоро будемо намагатися взяти Форт-Ост. Зробити це буде складно, ординці звикли до рівнинної місцевості. Проте я вірю в наших. Тим більше, їх тил прикриває такий спец, як ти.\n" +
                        "Ще одні чудові новини. Партнери поставили нові плюшки, а, якщо бути точним, дві нові установки. «Слон» - потужна, але досить повільна, і «Скорпіон» - швидка, проте б’є точково по маленькому радіусу. Детальніші характеристики почитай сам. До зв’язку.\n";
            }
            case 9 -> {
                return "Що ж, хотів сказати, що знову маю погані новини, проте ці обстріли вже потроху стають нормою. Готуйся, на підході гаряча доба. Я вірю в тебе. Удачі, салаго.";
            }
            case 10 -> {
                return "Феєрично, капітане, просто феєрично. Вони ще заплатять за все. Точніше, вже почали платити.\n" +
                        "Наші військові зайшли у Форт-Ост. Інформація достовірна. Це – перший звільнений регіональний центр. Думаю, це може стати непоганим бонусом до бюджету та рядів нашої армії. Ох, зараз цим ординцям буде непереливки.\n" +
                        "Щоправда, є і невтішна інформація. Тенебрійці отримали партію нового озброєння – дрібних залізних пташок, яких вони називають «мухами». Проте ми оперативно замовили у партнерів відповідні установки для збиття дрібних цілей. Ознайомся з ними і починай їх встановлення. Удачі.\n";
            }
            case 11 -> {
                return "А ці дрони – це та ще проблемка. Час масованої атаки, і я певен, що ворог застосовуватиме цей вид озброєння з подвійною силою. З хорошого - ще 75000 від командування. Працюй. Удачі, салаго.";
            }
            case 12 -> {
                return "Нашу країну не підкорять ні Коршуни, ні Мухи, ні будь що інше. Нашими військами було звільнено Гладіополіс – місто воїнів. Рухаємось до кордону семимильним кроками.\n" +
                        "А тим часом повітряний простір потрібно захищати. Бо битви перемагаються на землі, а от війни – у небі.\n" +
                        "Розвідка повідомила, що наступна загроза може піти з води. Під ударом опиняться Порт-Лазурі та Акватіс. Ех, зараз би на пляжик… Після війни обов’язково з’їздимо туди. Ех, золоті піски, золоті…\n";
            }
            case 13 -> {
                return "Друже… Мені здається, що ці гади ніколи не заспокояться. Ми отримали інформацію, що тенебряки готують страшний теракт. Вони хочуть підірвати дамби. Якщо хоч одна з плотин на Віті чи Фервенті дасть тріщину, половину країни знесе на дно Лазурового моря. А від Інтерфлюмінуса не залишиться і фундаменту. Нехай допоможе тобі Сонце Етерії, салаго. Вперед";
            }
            case 14 -> {
                return "ЄС! Атаку відбито! Я не мав жодного сумніву, що ти впораєшся. Як не мав жодного сумніву і в своїх бравих воїнах, яким тільки що вдалося звільнити Президіум – те саме місто, під яким дві сотні років тому була розбита Болотна Орда. «Можем павтаріть» - казали вони. Що, ж, повторимо, паскуди. Тільки треба трохи дотиснути.\n" +
                        "Але покидьки не стоять на місці. Розвідка повідомляє, що наступного тижня вони готові застосувати одразу ТРИ ноу-хау: гіперзвукову ракету «Сапсан», магнітний дрон «Електра» та ракету «Сновида». З першою боротися досить складно, проте ніяких особливих прийомів в неї немає – просто дуже швидка та смертоносна ракета. «Електри» - винахід дуже підступний. Це маленькі мухи, пристосовані спеціально для удару по етеростанціям. При влучанні вони вноситимуть дисбаланс у всю систему, тож запасайся «Пульсарами» – знадобляться. «Сновида» - це зовсім дика штука. Цей залізний птах невидимий для звичайних радарів. Для того, щоб його виявити і зробити придатним для збиття, необхідно застосувати спеціальний радар «Око Гора». Його нам теж передали партнери в трьох комплектаціях. Сподіваюсь, ти розберешся.\n";
            }
            case 15 -> {
                return "Оперативна інформація. У ординців новий підступний план. Вони вирішили позбавити країну енергії – вивести з ладу етеростанції. Дуже важливо не допустити катастрофи. Якщо хоч одна станція повністю зупиниться – це заморозить регіон до її відновлення. А запускати станцію з нуля втричі дорожче, ніж просто відремонтувати. А якщо, не дай Бог, вся країна позбавиться етеру і війде в повний блекаут… Можливо, це кінець. Тримай небо. Темряві не перемогти світло! Кажу, як казав завжди: удачі, салаго!";
            }
            case 16 -> {
                return "ТЕМРЯВІ НІКОЛИ НЕ ПЕРЕМОГТИ СВІТЛО! СОНЦЕ ЕТЕРІЇ ПАЛАТИМЕ ВІЧНО!\n" +
                        "Фух, я в захваті, салаго. Неймовірна робота. Залишилося трохи…\n" +
                        "Наші військові звільнили останній захоплений регіональний центр – пекучу Каліду. Рідне місто моєї бабці, до речі. До кордону зовсім трохи. Мерзоти вже психують, готують останні види залізних птахів: «Троянського коня» та «Кобру». З першої при збитті вилітатимуть мухи, з другої - швидкісна ракета. Нам передали установки, створені спеціально для захисту від цих типів озброєння, проте їх явно не вистачить, щоб покрити всю територію Етерії. Тож будь пильним. Вперед до перемоги!\n";
            }
            case 17 -> {
                return "Що ж, друже, настав момент істини. Польові частини повідомили про вихід на державний кордон. Армія противника розгромлена і відступає з наших земель. Каран-Гулук вже зрозумів, що шансів на бойову перемогу в його посіпак немає. Проте я знаю точно, що вони будуть чіплятися за останню можливість покласти нас на лопатки. В них на озброєнні лишається багато залізяччя, яке вони, за даними нашої розвідки, готові випустити по нашій країні майже водночас, цілячись прицільно у критичні об’єкти: етеростанції, плотини та, що найжахливіше, столицю. Вони знають, що загасивши Сонце Етерії, вони помножать на нуль всі наші бойові успіхи в цій війні. Це будуть страшні дні. Останнє випробування перед перемогою. Проте ми переможемо. Так вже склалася доля: одні пишуть геніальні книги, інші розпалюють ними багаття, одні створюють шедевральні картини, інші підтирають їх полотнами дупу, одні зводять величні міста, інші перетворюють їх на груди розбитого граніту. І ми не дамо цим «іншим» перемогти, нізащо!\n" +
                        "Ти маєш впоратися. Я вірю в тебе. Парадизіус не паде, доки він знаходиться під твоїм захистом. Ти – янгол-охоронець Етерії, її небесний щит. Від тебе залежить наше майбутнє. Не підведи. Удачі, салаго.\n";
            }
            case 18 -> {
                return "Остання партія на підході до Парадизіусу. ДАВАЙ!";
            }
            case 19 -> {
                return "ПЕРЕМОГА! ПЕРЕМОГА! ПЕРЕМОГА!!! Я знав, я не сумнівався!!! Я ж казав – битви перемагаються на землі, а війни – у небі. Ти зробив це, салаго. Ні, не салаго. Який же ти після такого салага? Ти – легенда, ти – герой Етерії на сотні поколінь вперед. Без тебе ми ніколи не подолали б тих клятих ординців. Аста-лавіста, Каран-Гулук!\n" +
                        "Салаго… Тобто, герою. Я чекаю тебе завтра на параді у столиці. Відсвяткуємо перемогу, пом’янемо полеглих героїв. А потім обов’язково якось поїдемо у Порт-Лазурі. Поніжимося на пляжику, вип’ємо холодного вина. Відпочинемо так, як заслуговують відпочивати переможці. До зустрічі, герою.\n";
            }
        }
        return "нема тексту капець";
    }
}
