package com.skyshield.game.gui.dialog;

import com.badlogic.gdx.Gdx;
import com.badlogic.gdx.graphics.g2d.BitmapFont;
import com.badlogic.gdx.graphics.g2d.freetype.FreeTypeFontGenerator;
import com.badlogic.gdx.scenes.scene2d.ui.Table;
import com.skyshield.game.screens.GameScreen;

public class DialogText extends Table {

    public static int textCounter = 1;
    final float letterSpawnTime = .02f;
    float timer = 0;

    String drawText;
    int stringIndex = 0;
    private BitmapFont font;
    private String text;
    private boolean written;
    public DialogText(String text) {
        this.text = text;
        this.drawText = "";
        setFont();
        this.written = false;
    }

    public boolean isWritten() {
        return this.written;
    }

    public void update(float delta) {
        timer += delta;
        if (timer >= letterSpawnTime) {
            if(stringIndex > 200 && stringIndex<text.length()) {
//                text = text.substring(drawText.length());
//                drawText = "";
//                stringIndex = 0;
                if(text.charAt(stringIndex) == '\n') drawText = drawText.substring(drawText.split("\\n")[0].length()+1) + text.charAt(stringIndex);
                else drawText = drawText + text.charAt(stringIndex);
                stringIndex++;
            }
            else if(stringIndex<text.length()) {
                drawText = drawText + text.charAt(stringIndex);
                stringIndex++;
            }else written = true;
            timer -= letterSpawnTime;
        }
        GameScreen.stage.getBatch().begin();
        font.draw(GameScreen.stage.getBatch(), drawText, 185, 630);
        GameScreen.stage.getBatch().end();
    }


    public void setFont() {
        FreeTypeFontGenerator fontGenerator = new FreeTypeFontGenerator(Gdx.files.internal("a_OldTyper.ttf"));
        FreeTypeFontGenerator.FreeTypeFontParameter fontParameter = new FreeTypeFontGenerator.FreeTypeFontParameter();
        fontParameter.characters = "абвгґдеєжзиійїклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЙЇКЛМНОПРСТУФХЦЧШЩЬЮЯ,,.?«»\"’–-:;!…";
        fontParameter.size = 15;
        font = fontGenerator.generateFont(fontParameter);
        fontGenerator.dispose();
    }

    public void skip() {
        text = (text.length() < 200) ? text : text.substring(text.length()-200);
        if(text.charAt(0)!='\n') text = text.substring(text.split("\\n")[0].length()+1);
        drawText = text;
        stringIndex = drawText.length();
    };
    public static String getText() {
        switch (textCounter) {
            case 1 -> {
                return "Алло, алло, прийом. Фух, \n" +
                        "нарешті вийшло зв’язатися з \n" +
                        "тобою, салаго. На рації генерал \n" +
                        "Аскель, головнокомандувач  \n" +
                        "військових сил Етерії. \n"+
                        "Хоча, навіщо я це кажу, ти ж \n" +
                        "і так знаєш, як звуть начальство? \n" +
                        "Проїхали. В буремні часи живемо, \n" +
                        "салаго… Одначе, місія тобі \n" +
                        "довірена справді надважлива.\n" +
                        "Ти навіть не уявляєш яка важлива.\n" +
                        "Ми довго готувалися до цієї \n" +
                        "війни, проте нам і в голову \n" +
                        "не приходило, що тупоголові \n" +
                        "ординці навчаться використову-\n" +
                        "вати провідну повітряну зброю. \n" +
                        "Інформація про те, що ворог \n" +
                        "має на озброєнні залізних птахів, \n" +
                        "по простому ракети, надійшла від \n" +
                        "нашої розвідки лише тиждень \n" +
                        "тому. Ми і самі не можемо в \n" +
                        "це повірити. Ми вважали, що \n" +
                        "крізь нашу розвідку і муха не \n" +
                        "пролетить, але ці покидьки \n" +
                        "примудрилися домовитися з \n" +
                        "цивілізаціями сходу про постав-\n" +
                        "ки і тримали їх у великій \n" +
                        "таємниці. Акзилія погодилася \n" +
                        "надати нам певні елементи \n" +
                        "своєї системи «Небесний щит». \n" +
                        "Оскільки часу до вторгнення \n" +
                        "залишалося обмаль, ми \n" +
                        "тільки-но імпортували перші \n" +
                        "установки. Поки що тільки \n" +
                        "найпростіша зброя: «Крони» \n" +
                        "першого, другого та третього \n" +
                        "поколінь. Різняться базовими \n" +
                        "характеристиками та і тільки. \n" +
                        "Їх головнокомандувач надав \n" +
                        "певні інструкції з викори-\n" +
                        "стання, передаю їх тобі:\n" +
                        "Там нічого складного насправді.\n" +
                        "Оптимальна швидкість – це \n" +
                        "показник, який вказує \n" +
                        "максимальну швидкість \n" +
                        "повітряного об’єкта, \n" +
                        "на якій установка здатна збивати\n" +
                        "його з максимальною\n" +
                        "ефективністю. Якщо об’єкт \n" +
                        "летить швидше, ефективність \n" +
                        "падатиме. Оптимальний розмір – \n" +
                        "схожа механіка. Хіба що динаміка \n" +
                        "протилежна – менші об’єкти \n" +
                        "збивати тяжче.\n" +
                        "Перезарядка – час, необхідний \n" +
                        "на те, щоб установка знову \n" +
                        "увійшла в стрій після \n" +
                        "спроби збиття.\n" +
                        "Радіус – це відповідно радіус \n" +
                        "круга, який\n" +
                        "покривається установкою.\n" +
                        "Рівномірність – здатність \n" +
                        "зберігати центрову \n" +
                        "ефективність на краях \n" +
                        "діапазону дії.\n" +
                        "По суті ці п’ять характеристик \n" +
                        "визначають ефективність \n" +
                        "установки. Думаю, що ти \n" +
                        "розберешся з цими \n" +
                        "справами. Тобі доручено \n" +
                        "керувати системою, а отже \n" +
                        "розставити всі \n" +
                        "елементи у стратегічній \n" +
                        "відповідності, захистивши \n" +
                        "ключові об’єкти.\n" +
                        "Наразі наша розвідка доповідає, \n" +
                        "що наступні удари можуть прийтися \n" +
                        "по Сільвестрісу та \n" +
                        "Інтерфлюмінусу із району \n" +
                        "ворожого міста Зулим-Кала. \n" +
                        "Поки що на балансі не так багато \n" +
                        "валюти, тож встанови по установці \n" +
                        "першого рівня поблизу цих міст. \n" +
                        "Удачі.\n";
            }
            case 2 -> {
                return "ЮХУ! \n" +
                        "Обидві повітряні цілі збито. \n" +
                        "Молодець, салаго. \n" +
                        "Щоправда, ми маємо невелику \n" +
                        "проблемку – повідомляють про \n" +
                        "пуск ще однієї пташки в район \n" +
                        "гір, вірогідно, у місто Монфіор. \n" +
                        "Моє рідне, до речі. \n" +
                        "Хай вони тільки спробують.";
            }
            case 3 -> {
                return "ЧОРТ! Ціль досягла міста! \n" +
                        "О рідний мій Монфіор! \n" +
                        "Вони заплатять за це, чуєш! \n" +
                        "Будь проклятий Карам-Гулук!\n" +
                        "Салаго… \n" +
                        "Тобі доведеться трохи \n" +
                        "приглянути за містом. \n" +
                        "Обери його та оформи ремонт. \n" +
                        "Формула визначення ціни \n" +
                        "скоро стане очевидною. \n" +
                        "Удачі.\n";
            }
            case 4 -> {
                return "Молодець.\n" +
                        "Моє місто житиме. \n" +
                        "Продовжуй в тому ж дусі, друже.";
            }
            case 5 -> {
                return "Друже… Маю погані новини. \n" +
                        "Схоже, що ці мерзоти зрозуміли, \n" +
                        "що ми пристосувалися до їх атак, \n" +
                        "тому вирішили під накопичити \n" +
                        "пташок для серйозної атаки. \n" +
                        "Поки що я не знаю, як наші \n" +
                        "системи впораються з таким \n" +
                        "навантаженням, проте я вибив \n" +
                        "із уряду додаткові 20000 злотих. \n" +
                        "Цього тобі вистачить аж на 40 \n" +
                        "перших «Крон». Ну або на 4 треті. \n" +
                        "Розпоряжайся, як знаєш. \n" +
                        "Удачі, бійцю.";
            }
            case 6 -> {
                return "Мені зозуля на хвості принесла, \n" +
                        "що ти відбив атаку? \n" +
                        "Не сумнівався в тобі, салаго. \n" +
                        "Так ти скоро і на підвищення підеш. \n" +
                        "Проте не розслабляйся, попереду \n" +
                        "ще довга війна. І вони ще \n" +
                        "застосують багато нового \n" +
                        "озброєння та нових тактик, повір.";
            }
            case 7 -> {
                return "Друже… Маю погані новини. \n" +
                        "Знову. \n" +
                        "Вони знову накопичили \n" +
                        "багато зброї. І, якщо мої \n" +
                        "джерела достовірні, вони \n" +
                        "готують новий вид зброї. \n" +
                        "Кріпись, салаго. \n" +
                        "Від тебе багато залежить.";
            }
            case 8 -> {
                return "Чудово. Ми пережили атаку. \n" +
                        "А зараз відбій.\n" +
                        "Чудові новини з фронту. \n" +
                        "Завдяки поставкам вдалося \n" +
                        "трохи відсунути натиск \n" +
                        "загарбників. Якщо все йтиме \n" +
                        "за планом, скоро будемо \n" +
                        "намагатися взяти Форт-Ост. \n" +
                        "Зробити це буде складно, \n" +
                        "ординці звикли до рівнинної \n" +
                        "місцевості. Проте я вірю в наших. \n" +
                        "Тим більше, їх тил прикриває \n" +
                        "такий спец, як ти.\n" +
                        "Ще одні чудові новини. Партнери \n" +
                        "поставили нові плюшки, а, якщо \n" +
                        "бути точним, дві нові установки. \n" +
                        "«Слон» - потужна, але досить \n" +
                        "повільна. «Скорпіон» - швидка, \n" +
                        "проте б’є точково. Детальніші \n" +
                        "характеристики почитай сам. \n" +
                        "Удачі, салаго.\n";
            }
            case 9 -> {
                return "Що ж, ці обстріли \n" +
                        "вже потроху стають нормою. \n" +
                        "Готуйся, на підході \n" +
                        "гаряча доба. \n" +
                        "Я вірю, салаго, я вірю…";
            }
            case 10 -> {
                return "Феєрично, капітане, феєрично. \n" +
                        "Вони ще заплатять за все. \n" +
                        "Точніше, вже почали платити.\n" +
                        "Наші військові зайшли \n" +
                        "у Форт-Ост. Інформація досто-\n" +
                        "вірна. Ох, зараз їм буде \n" +
                        "непереливки.\n" +
                        "Щоправда, є і невтішна інформація. \n" +
                        "Тенебрійці отримали партію нового \n" +
                        "озброєння – дрібних пташок, \n" +
                        "яких вони називають «мухами». \n" +
                        "Проте ми оперативно замовили у \n" +
                        "партнерів установки для збиття \n" +
                        "дрібних цілей. \n" +
                        "Я вірю в тебе. Удачі. \n";
            }
            case 11 -> {
                return "Час масованої атаки. \n" +
                        "Ще 75000 від командування. \n" +
                        "Працюй.";
            }
            case 12 -> {
                return "Нашу країну не підкорять \n" +
                        "ні Коршуни, ні Мухи, ні \n" +
                        "будь що інше. Нашими \n" +
                        "військами було звільнено \n" +
                        "Гладіополіс – місто воїнів. \n" +
                        "Рухаємось до кордону \n" +
                        "семимильним кроками. \n" +
                        "А тим часом повітряний \n" +
                        "простір потрібно захищати. \n" +
                        "Бо битви перемгаюаться на \n" +
                        "землі, а от війни – у небі.\n" +
                        "Розвідка повідомила, що \n" +
                        "наступна загроза може \n" +
                        "піти з води. Під ударом \n" +
                        "опиняться Порт-Лазурі та \n" +
                        "Акватіс. Ех, зараз би на \n" +
                        "пляжик… Після війни \n" +
                        "обов’язково з’їздемо туди. \n" +
                        "Ех, золоті піски Кастилії…\n";
            }
            case 13 -> {
                return "Друже… Мені здається, \n" +
                        "що ці гади ніколи \n" +
                        "не заспокояться. \n" +
                        "Ми отримали інформацію, \n" +
                        "що тенебряки готують \n" +
                        "страшний теракт. Вони \n" +
                        "хочуть підірвати дамби. \n" +
                        "Якщо хоч одна з плотин на \n" +
                        "Віті чи Фервенті дасть \n" +
                        "тріщину, половину країни \n" +
                        "знесе на дно Лазурового \n" +
                        "моря. А від Інтерфлюмінуса \n" +
                        "не залишиться і фундаменту. \n" +
                        "Нехай допоможе тобі \n" +
                        "Сонце Етерії, салаго. Вперед";
            }
            case 14 -> {
                return "ЄС! Атаку відбито! \n" +
                        "Я не мав жодного сумніву, \n" +
                        "що ти впораєшся. Як не \n" +
                        "мав жодного сумніву і в \n" +
                        "своїх бравих воїнах, яким \n" +
                        "тільки що вдалося звільнити \n" +
                        "Президіум – те саме місто, \n" +
                        "під яким дві сотні років \n" +
                        "тому була розбита Болотна Орда. \n" +
                        "«Можем павтаріть» - казали вони. \n" +
                        "Що, ж, повторимо, паскуди. \n" +
                        "Тільки треба трохи дотиснути.\n" +
                        "Але покидьки не стоять на \n" +
                        "місці. Розвідка повідомляє, \n" +
                        "що наступного тижня вони готові \n" +
                        "застосувати одразу ТРИ ноу-хау: \n" +
                        "гіперзвукову ракету «Сапсан», \n" +
                        "магнітний дрон «Електра» та \n" +
                        "ракету «Сновида». З першою \n" +
                        "боротися досить складно, проте \n" +
                        "ніяких особливих прийомів в неї \n" +
                        "немає – просто дуже швидка та \n" +
                        "смертоносна ракета. «Електри» \n" +
                        "- винахід дуже підступний. \n" +
                        "Це маленькі мухи, пристосовані \n" +
                        "спеціально для удару по \n" +
                        "етеростанціям. При влучанні вони \n" +
                        "вноситимуть дисбаланс у всю \n" +
                        "систему, тож запасайся \n" +
                        "«Пульсарами» – знадобляться. \n" +
                        "«Сновида» - це зовсім дика \n" +
                        "штука. Цей залізний птах \n" +
                        "невидимий для звичайних радарів. \n" +
                        "Для того, щоб його виявити і \n" +
                        "зробити придатним для збиття, \n" +
                        "необхідно застосувати \n" +
                        "спеціальний радар «Око Гора». \n" +
                        "Його нам теж передали партнери \n" +
                        "в трьох комплектаціях. \n" +
                        "Сподіваюсь, ти розберешся. \n" +
                        "Кажу, як казав завжди: \n" +
                        "удачі, салаго!\n";
            }
            case 15 -> {
                return "Салаго, \n" +
                        "оперативна інформація. \n" +
                        "У ординців новий підступний \n" +
                        "план. Вони вирішили \n" +
                        "позбавити країну енергії \n" +
                        "– вивести з ладу етеростанції. \n" +
                        "Дуже важливо не допустити \n" +
                        "катастрофи. Якщо хоч одна \n" +
                        "станція повністю зупиниться \n" +
                        "– це заморозить регіон до її \n" +
                        "відновлення. А запускати \n" +
                        "станцію з нуля втричі дорожче, \n" +
                        "ніж просто відремонтувати. \n" +
                        "А якщо, не дай Бог, вся \n" +
                        "країна позбавиться етеру і \n" +
                        "війде в повний блекаут… \n" +
                        "Можливо, це кінець. Тримай \n" +
                        "небо, салаго. Темряві не \n" +
                        "перемогти світло! \n" +
                        "Удачі.";
            }
            case 16 -> {
                return "ТЕМРЯВІ НІКОЛИ НЕ \n" +
                        "ПЕРЕМОГТИ СВІТЛО! \n" +
                        "СОНЦЕ ЕТЕРІЇ ПАЛАТИМЕ ВІЧНО!\n" +
                        "Фух, я в захваті, салаго. \n" +
                        "Неймовірна робота. \n" +
                        "Залишилося трохи…\n" +
                        "Наші військові звільнили \n" +
                        "останній захоплений \n" +
                        "регіональний центр \n" +
                        "– пекучу Каліду. Рідне \n" +
                        "місто моєї бабці, до речі. \n" +
                        "До кордону зовсім трохи. \n" +
                        "Мерзоти вже психують, \n" +
                        "готують останні види \n" +
                        "залізних птахів: \n" +
                        "«Троянського коня» та «Кобру». \n" +
                        "З першої при збитті \n" +
                        "вилітатимуть мухи, з другої \n" +
                        "- швидкісна ракета. \n" +
                        "Нам передали установки, \n" +
                        "створені спеціально для \n" +
                        "захисту від цих типів \n" +
                        "озброєння, проте їх явно \n" +
                        "не вистачить, щоб покрити \n" +
                        "всю територію Етерії. Тож \n" +
                        "будь пильним. \n" +
                        "Вперед до перемоги!\n";
            }
            case 17 -> {
                return "Що ж, друже, настав \n" +
                        "момент істини. Польові \n" +
                        "частини повідомили про \n" +
                        "вихід на державний кордон. \n" +
                        "Армія противника розгро-\n" +
                        "млена і відступає з наших \n" +
                        "земель. Каран-Гулук вже \n" +
                        "зрозумів, що шансів на \n" +
                        "бойову перемогу в його \n" +
                        "посіпак немає. Проте я \n" +
                        "знаю точно, що вони будуть \n" +
                        "чіплятися за останню мож-\n" +
                        "ливість покласти нас на \n" +
                        "лопатки. В них на озброєнні \n" +
                        "лишається багато залізяччя, \n" +
                        "яке вони, за даними нашої \n" +
                        "розвідки, готові випустити \n" +
                        "по нашій країні майже водно-\n" +
                        "час, цілячись прицільно у \n" +
                        "критичні об’єкти: етеростанції, \n" +
                        "плотини та, що найжахливіше, \n" +
                        "столицю. Вони знають, що загасив-\n" +
                        "ши Сонце Етерії, вони помножать \n" +
                        "на нуль всі наші бойові успіхи \n" +
                        "в цій війні. Це будуть страшні \n" +
                        "дні. Останнє випробування перед \n" +
                        "перемогою.\n" +
                        "Ти маєш впоратися. \n" +
                        "Я вірю в тебе. Парадизіус не паде, \n" +
                        "доки він знаходиться під твоїм \n" +
                        "захистом. Ти – янгол-охоронець \n" +
                        "Етерії, її небесний щит. Від \n" +
                        "тебе залежить наше майбутнє. \n" +
                        "Не підведи. \n" +
                        "Удачі, салаго.\n";
            }
            case 18 -> {
                return "Остання партія на\n" +
                        "підході до Парадизіусу. \n" +
                        "ДАВАЙ!";
            }
            case 19 -> {
                return "ПЕРЕМОГА! \n" +
                        "ПЕРЕМОГА! \n" +
                        "ПЕРЕМОГА!!! \n" +
                        "Я знав, я не сумнівався!!! \n" +
                        "Я ж казав – битви \n" +
                        "перемагаються на землі, \n" +
                        "а війни – у небі. \n" +
                        "Ти зробив це, салаго. \n" +
                        "Ні, не салаго. Який же \n" +
                        "ти після такого салага? \n" +
                        "Ти – легенда, ти – герой \n" +
                        "Етерії на сотні поколінь \n" +
                        "вперед. Без тебе ми ніколи \n" +
                        "не подолали б тих клятих \n" +
                        "ординців. Аста-лавіста, \n" +
                        "Каран-Гулук!\n" +
                        "Салаго… Тобто, герою. Я \n" +
                        "чекаю тебе завтра на параді \n" +
                        "у столиці. Відсвяткуємо \n" +
                        "перемогу, пом’янемо полеглих \n" +
                        "героїв. А потім обов’язково \n" +
                        "якось поїдемо у Порт-Лазурі. \n" +
                        "Поніжимося на пляжику, \n" +
                        "вип’ємо холодного вина. \n" +
                        "Відпочинемо так, як \n" +
                        "заслуговують відпочивати \n" +
                        "переможці. \n" +
                        "До зустрічі, герою.\n";
            }
        }
        return "нема тексту капець";
    }
}
